





// Основные типы | int | float | char | string | bool
// // Целочисленные типы
// byte b; // 0 - 255
// sbyte sb; // -128 - 127
// short s; // - 32768 - 32768
// ushort us; // 0 - 65535
// int i; // - 2147483648 - 2147483647
// uint ui; // 0 - 4294672295
// long l = long.MaxValue; // просмотреть значение  (макс и мин)
// ulong ul;
// // Числа с плавающей точкой
// float f = 5.7f;    // до 7 знаков после ,
// double d = 5.7;   // до 15 знаков после ,
// // символьные типы
// char c = ' ';
// // строковый тип
// string str = "это строка";
// // логический тип
// bool bl;
// // логическое И &&
// // логическое ИЛИ ||
